---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Dispose
source: html/f3bd0d53-e969-b575-c83b-4952f1f997db.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Dispose Method

Releases all resources used by the DuctFittingAndAccessoryConnectorData

## Syntax (C#)
```csharp
public void Dispose()
```